[
  {
    "id": "clear_save",
    "icon": "<i class=\"fas fa-file-times\"></i>",
    "title": "Clear Saved Game Data?",
    "description": "Clear your saved game data from this browser? This action is irreversible."
  },
  {
    "id": "export_save",
    "icon": "<i class='fas fa-file-export'></i>",
    "title": "Export Saved Game Data?",
    "description": "Export your game data for sharing or use at a later time in another browser, computer or device. Copy the export string below for importing."
  },
  {
    "id": "import_save",
    "icon": "<i class=\"fas fa-file-import\"></i>",
    "title": "Import Saved Game Data?",
    "description": "Import game data by inputting the export string and pressing the 'Import Save' button."
  },
  {
    "id": "playfab",
    "icon": "<i class=\"fas fa-cloud-download-alt\"></i>",
    "title": "Export or Import to Cloud?",
    "description": "Log into or register an account with Playfab below. Export or import your cloud save on any device."
  },
  {
    "id": "settings",
    "icon": "<i class=\"fas fa-cog\"></i>",
    "title": "Settings",
    "description": "Adjust your game preferences and settings. These settings will only be applied to this browser."
  },
  {
    "id": "patch_notes",
    "icon": "<i class=\"fas fa-file-edit\"></i>",
    "title": "Patch Notes",
    "description": "Read the latest additions, improvements and changes made to Forge & Fortune."
  },
  {
    "id": "offline_stats",
    "icon": "<i class=\"fas fa-tasks\"></i>",
    "title": "Offline Progression",
    "description": "Here's what happened while you were offline."
  },
  {
    "id": "end_commendation",
    "icon": "<i class=\"fas fa-heart\"></i>",
    "title": "Thanks for playing!",
    "description": "Thank you for playing our beta version of Forge & Fortune!<br><br> You've slain the Big Bad Evil Guy, and have more or less reached the end of the current F&F journey. Don't fret, however -- we've got a very long list of things we plan on adding to the game, and have many quality of experience improvements in the works.<br><br> Want to be notified about updates? Have vital feedback for our team? Join us on Discord! Our Patreon Supporters get early access to our new content, so if that interests you, check us out."
  }
]